docs/stress-test/results/k6/stage5-k6-full-flow-session-1vu.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/k6/rme-full-flow-50-users.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 1m0s max duration (incl. graceful stop):
              * full_flow_users: 1 looping VUs for 30s (exec: fullFlow, gracefulStop: 30s)


running (0m01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [   3% ] 1 VUs  01.0s/30s

running (0m02.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [   7% ] 1 VUs  02.0s/30s

running (0m03.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
full_flow_users   [  10% ] 1 VUs  03.0s/30s

running (0m04.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
full_flow_users   [  13% ] 1 VUs  04.0s/30s

running (0m05.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
full_flow_users   [  17% ] 1 VUs  05.0s/30s

running (0m06.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
full_flow_users   [  20% ] 1 VUs  06.0s/30s

running (0m07.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
full_flow_users   [  23% ] 1 VUs  07.0s/30s

running (0m08.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
full_flow_users   [  27% ] 1 VUs  08.0s/30s

running (0m09.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
full_flow_users   [  30% ] 1 VUs  09.0s/30s

running (0m10.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
full_flow_users   [  33% ] 1 VUs  10.0s/30s

running (0m11.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
full_flow_users   [  37% ] 1 VUs  11.0s/30s

running (0m12.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
full_flow_users   [  40% ] 1 VUs  12.0s/30s

running (0m13.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
full_flow_users   [  43% ] 1 VUs  13.0s/30s

running (0m14.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
full_flow_users   [  47% ] 1 VUs  14.0s/30s

running (0m15.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
full_flow_users   [  50% ] 1 VUs  15.0s/30s

running (0m16.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
full_flow_users   [  53% ] 1 VUs  16.0s/30s

running (0m17.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
full_flow_users   [  57% ] 1 VUs  17.0s/30s

running (0m18.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
full_flow_users   [  60% ] 1 VUs  18.0s/30s

running (0m19.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
full_flow_users   [  63% ] 1 VUs  19.0s/30s

running (0m20.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
full_flow_users   [  67% ] 1 VUs  20.0s/30s

running (0m21.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
full_flow_users   [  70% ] 1 VUs  21.0s/30s

running (0m22.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
full_flow_users   [  73% ] 1 VUs  22.0s/30s

running (0m23.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
full_flow_users   [  77% ] 1 VUs  23.0s/30s

running (0m24.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
full_flow_users   [  80% ] 1 VUs  24.0s/30s

running (0m25.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
full_flow_users   [  83% ] 1 VUs  25.0s/30s

running (0m26.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
full_flow_users   [  87% ] 1 VUs  26.0s/30s

running (0m27.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
full_flow_users   [  90% ] 1 VUs  27.0s/30s

running (0m28.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
full_flow_users   [  93% ] 1 VUs  28.0s/30s

running (0m29.0s), 1/1 VUs, 13 complete and 0 interrupted iterations
full_flow_users   [  97% ] 1 VUs  29.0s/30s

running (0m30.0s), 1/1 VUs, 13 complete and 0 interrupted iterations
full_flow_users   [ 100% ] 1 VUs  30.0s/30s


  █ THRESHOLDS 

    full_flow_duration
    ✓ 'p(95)<15000' p(95)=2296.6

    full_flow_success_rate
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<1000' p(95)=21.55ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 130     4.265436/s
    checks_succeeded...: 100.00% 130 out of 130
    checks_failed......: 0.00%   0 out of 130

    ✓ login_page HTTP 200
    ✓ login accepted
    ✓ context accepted
    ✓ dashboard_auth_check HTTP 200
    ✓ rme_dashboard HTTP 200
    ✓ rme_visits HTTP 200
    ✓ rme_visit_show HTTP 200
    ✓ rme_medical_record HTTP 200
    ✓ rme_odontogram HTTP 200
    ✓ rme_cashier HTTP 200
    ✓ rme_receivables HTTP 200
    ✓ rme_reports_patients HTTP 200
    ✓ rme_reports_payments HTTP 200

    CUSTOM
    full_flow_duration.............: avg=2177    min=2140   med=2147.5  max=2554     p(90)=2157.4  p(95)=2296.6 
    full_flow_success_rate.........: 100.00% 14 out of 14

    HTTP
    http_req_duration..............: avg=19.75ms min=16.9ms med=18.66ms max=224.05ms p(90)=20.72ms p(95)=21.55ms
      { expected_response:true }...: avg=19.75ms min=16.9ms med=18.66ms max=224.05ms p(90)=20.72ms p(95)=21.55ms
    http_req_failed................: 0.00%   0 out of 261
    http_reqs......................: 261     8.563682/s

    EXECUTION
    iteration_duration.............: avg=2.17s   min=2.13s  med=2.14s   max=2.55s    p(90)=2.15s   p(95)=2.29s  
    iterations.....................: 14      0.459355/s
    vus............................: 1       min=1        max=1
    vus_max........................: 1       min=1        max=1

    NETWORK
    data_received..................: 816 kB  27 kB/s
    data_sent......................: 210 kB  6.9 kB/s



running (0m30.5s), 0/1 VUs, 14 complete and 0 interrupted iterations
full_flow_users ✓ [ 100% ] 1 VUs  30s